Repository: BlasiusSecundus/Webtrees-Branch-Export
Catalog: language/*.po
Languages: de, hu

source: The tree to which this preset belonged was deleted
de: Der Familienbaum zu dem diese Ast-Daten gehören wurden gelöscht
hu: Törölték a fát, melyhez ez a sablon tartozott

source: Orphaned
de: Verwaist
hu: Elárvult

source: No preset selected.
hu: Nem jelölt ki egy sablont sem.

source: Delete selected presets?
de: Selektierte Ast Einstellung wirklich löschen?
hu: Törli a kijelölt sablonokat?

source: No orphaned presets found.
hu: Nincs elárvult sablon.

source: Are you sure you want to uninstall this module? (NOTE: all presets and module-related settings will be permanently deleted and the module will be disabled. Module files will not be removed. They must be manually deleted. The module can be reactivated on the 'Control Panel / Modules / Module administration' page.)
de: Bist du sicher das du dieses Modul deinstallieren willst? (Bemerkung: Alle Ast-Daten und Modul bezogenen Einstellungen werden permanent gelöscht und das Modul wird deaktiviert. Die Modul Dateien werden nicht gelöscht, diese müssen manuell gelöscht werden. Das Modul kann wieder aktiviert werden via Verwaltung - Module - Verwaltungsmodul)
hu: Biztosan szeretné eltávolítani ezt a modult? (MEGJEGYZÉS: ez a művelet minden sablont és modulspecifikus beállítást törölni fog. A modulfájlokat azonban nem törli, azokat manuálisan kell eltávolítani. A modult újra aktiválhatja a 'Vezérlőpult/Modulok/Moduladminisztráció' oldalon.)

source: Cutoff point #%d:
de: Endpunkt #%d:
hu: %d. végpont:

source: Please select a preset from the dropdown.
de: Bitte wähle die Ast-Einstellung von der Dropdown Liste.
hu: Kérjük, válasszon egy sablont a legördülő menüből!

source: Are you sure you want to delete this preset: %s?
de: Bist du sicher das du diese Ast-Einstellung löschen möchtest: %s?
hu: Biztosan törölni szeretné ezt a sablont: %s?

source: %s is the current name of the selected preset. Please choose a different name, or click 'Save' instead.
de: %s ist der jetzige Name der selektierten Ast-Einstellung. Bitte wähle einen neuen Namen, oder klicke 'Save'.
hu: %s a sablon jelenlegi neve. Kérjük, válasszon másik nevet, vagy kattintson a 'Mentés' gombra!

source: A preset name is required.
de: Ein Name für diese Ast-Einstellung ist erforderlich.
hu: Nevet kell adnia a sablonnak.

source: Unable to delete preset '%s'. Preset does not exist?
de: Diese Ast-Einstellung '%s' kann nicht gelöscht werden. Existiert sie?
hu: Nem sikerült a(z) '%s' sablon törlése. Nincs ilyen sablon?

source: Full name
de: Voller Name
hu: Teljes név

source: Total %s records in this tree
de: Total %s Datensätze in diesem Baum
hu: Összesen %s rekord ebben a családfában

source: %s records in this branch
de: %s Datensätze in diesem Ast
hu: %s rekord ezen az ágon

source: Branch export module
de: Branch Export Modul
hu: Branch export modul

source: Preset with the same name (%s) already exists for the target tree.
de: Die Ast-Daten mit Namen (%s) existieren schon für diesen Baum.
hu: Már létezik azonos nevű (%s) sablon ebben a családfában.

source: Branch export module - database initialization needed
de: Branch Export Modul - Datenbank muss noch Initialisiert werden
hu: Branch export modul - az adatbázist létre kell hozni

source: It is required to initialize the data table where the branch export module stores the branch presets. This initialization is done automatically, but we ask for your permission so you have a chance to back up your data. The update should not harm your data in any way, but it is always a good idea to create a backup first.
de: Das Branch Export Modul speichert die Daten in eingene Tabellen und diese müssen noch vorbereitet werden. Dies geschieht automatisch, dennoch fragen wir hier um dein Einverständnis, damit du vorher noch eine Datensicherung machen kannst. Dieses Update wird deine Familenbaum Daten überhaupt nicht berühren und es ist immer eine gute Idee eine Datensicherung zu machen.
hu: A modul használata előtt létre kell hozni azt az adattáblát, melyben a modul a mentett beállításokat tárolni fogja. Ezt a modul automatikusan megteszi, de a művelet végrehajtásához az engedélyét kérjük, hogy biztonsági mentést tudjon készíteni adatairól. A frissítés semmilyen módon nem veszélyezteti az adatait, de a biztonság kedvéért mégis azt javasoljuk, hogy készítsen biztonsági mentést.

source: As soon as you are ready to perform the initialization, click the link below.
de: Sobald du bereit bist die Export Branch Tabelle vorzubereiten, dann bitte den Link anklicken.
hu: Ha készen áll az adattábla létrehozására, kattintson az alábbi linkre!

source: Perform Initialization
de: Vorbereitung der Tabellen läuft
hu: Adattábla létrehozása

source: Only administrators can initialize the data table.
de: Nur Administratoren können die Daten Tabelle erstellen.
hu: Ezt a műveletet csak adminisztrátor jogosultságú felhasználó hajthatja végre.

source: Branch export module - database update needed
de: Branch Export Modul - Datenbank Update nötig
hu: Branch export modul - az adatbázist frissíteni kell

source: It is required to update the data table where the branch export module stores the branch presets. This update is done automatically, but we ask for your permission so you have a chance to back up your data. The update should not harm your data in any way, but it always a good idea to create a backup first.
de: Es ist nötig die Export Branch Tabellen zu aktualisieren. Diese Update wird automatisch gemacht, dennoch fragen wir hier um dein Einverständnis, damit du vorher noch eine Datensicherung machen kannst. Dieses Update wird deine Familienbaum Daten überhaupt nicht berühren und es ist immer eine gute Idee eine Datensicherung zu machen.
hu: A modul további használatához frissíteni kell az adattáblát, melyben a modul a mentett beállításokat tárolja. A frissítést a modul automatikusan elvégzi, de a művelet végrehajtásához az engedélyét kérjük, hogy biztonsági mentést tudjon készíteni adatairól. A frissítés semmilyen módon nem veszélyezteti az adatait, de a biztonság kedvéért mégis azt javasoljuk, hogy készítsen biztonsági mentést.

source: As soon as you are ready to perform the update, click the link below.
de: Sobald du bereit bist das Update zu machen, bitte den Link unten anklicken.
hu: Ha készen áll az adattábla frissítésére, kattintson az alábbi linkre!

source: Perform Update
de: Update läuft
hu: Frissítés végrehajtása

source: Only administrators can update the database.
de: Nur Administratoren können die Datenbank updaten.
hu: Ezt a műveletet csak adminisztrátor jogosultságú felhasználó hajthatja végre.

source: Branch export config
de: Branch Export Einstellung
hu: Branch export konfiguráció

source: Settings are only available for admins.
de: Einstellungen sind nur für Administratoren verfügbar.
hu: A beállításokat csak adminisztrátor jogosultságú felhasználó szerkesztheti.

source: Manage presets
de: Ast Einstellungen verwalten
hu: Mentett sablonok kezelése

source: Tree:
de: Stammbaum:
hu: Fa:

source: All trees
de: Alle Bäume
hu: Minden fa

source: Select specific tree
de: Bitte Baum wählen
hu: Válasszon egy fát

source: Select preset(s):
de: Ast Einstellung wählen:
hu: Sablon(ok) kijelölése:

source: Select orphaned
de: Wähle verwaiste Einstellungen
hu: Elárvultak kijelölése

source: Preset details
de: Ast Einstellung Detail
hu: A sablon adatai

source: Name:
hu: Név:

source: Pivot:
de: Drehpunkt:
hu: Kiindulópont:

source: Cutoff:
de: Endpunkt:
hu: Végpont:

source: Delete selected presets
de: Selektierte Ast Einstellung löschen
hu: Kijelöltek törlése

source: Copy selected presets to:
de: Kopiere selektierte Ast Einstellung zu:
hu: Kijelöltek másolása ide:

source: uninstall
de: deinstallieren
hu: eltávolítás

source: Invalid pivot point selected: %s. No such individual found in the current tree.
de: Ungültigen Drehpunk selektiert: %s. Namen im jetzigen Baum nicht gefunden.
hu: Érvénytelen kiindulópontot választott: %s. Nincs ilyen személy ebben a családfában.

source: No pivot point selected.
de: Kein Drehpunkt selektiert.
hu: Nem választott kiindulópontot.

source: Branch preview
de: Branch Vorschau
hu: Előnézet

source: Pivot individual
de: Drehpunkt Person
hu: Kiindulópont

source: Cutoff points:
de: Endpunkte:
hu: Végpontok:

source: %s records in the branch
de: %s Datensätze in diesem Baum
hu: %s rekordok ezen az ágon

source: Cutoff point %d:
de: Endpunkt %d:
hu: %d. végpont:

source: Remove cutoff point
de: Endpunkt löschen
hu: Végpont eltávolítása

source: How branch export works
de: So funktioniert Branch Export
hu: Így működik a Branch export modul

source: Branch export module helps you export a portion of a tree in a way that is not possible using the built-in export features.
de: Das Branch Export Modul hilft dir einen Teil (Ast) eines Baumes zu exportieren.
hu: A Branch export modul segítségével a családfa egy részét exportálhatja olyan módon, ahogy a Webtrees beépített exportálási funkcióival nem lehetséges.

source: Branch export traverses the entire tree, starting from a specific individual (called pivot point). First it will select the immediate relatives of the pivot individual (e. g. parents, children, spouses, siblings). Then continues the traversal recursively with their relatives, processing them like the pivot point - unless they are one of the predefined blocking individuals (called cutoff points). The traversal will stop when all non-blocked individuals are processed.
de: Dieses Modul sucht nach allen Verbindungen von einem Ausgangspunkt (Drehpunkt) an. Zuerst wird es die nächst liegenden Verwandten selektieren (Eltern, Kinder, Ehepartner, Geschwister), dann wird mit diesen Verwandten rekursiv weitergearbeitet als ob diese der Drehpunkt wären, ausser es ist ein vordefinierter Endpunkt erreicht. Das Ende ist erreicht wenn alle verlinkten Datensätze abgearbeitet sind.
hu: A Branch export bejárja az egész fát, a kiindulópontként megjelölt személytől kezdve. Először kiválasztja a kiindulópont közvetlen hozzátartozóit (pl. gyermek, szülő, testvér, házastárs). Ezután rekurzív módon folytatja a fa bejárását, a kiindulóponthoz hasonló módon feldolgozva a rokonokat is - kivéve, ha azok a megadott végpontok közé tartoznak. A fa bejárása leáll, ha az összes olyan személyt feldolgozta, melyek elérését a végpontként megadott személyek nem blokkolták.

source: You can use an unlimited number of cutoff points.
de: Du kannst so viele Endpunkte wie du willst definieren.
hu: Korlátlan számú végpontot megadhat.

source: What records are included in the branch?
de: Was für Datensätze sind in diesem Ast?
hu: Mely rekordokat veszi fel a modul az exportált ágba?

source: The pivot point is always included. Cutoff points are also included if they can be reached during the traversal, but the traversal algorithm will stop traversing the tree when it hits a cutoff point, and thus their relatives - that are not reachable using a different path - will not be included. If an individual is included in the branch, all linked records (families, media objects, sources, notes, repositories) are also added.
de: Der Drehpunkt ist immer beinhaltet. Endpunkte sind auch beinhaltet wenn diese in der Suche erreicht werden. Der Algorithmus hört bei jedem Endpunkt auf zu suchen, verarbeitet aber alle direkten Verwandten. Wenn eine Person inbegriffen ist dann werden alle dazu gehörenden Datensätze (Familien, Media Objekte, Sources, Notes, ...) auch dazu genommen.
hu: A kiindulópontot mindenképpen. A végpontokat is felveszi, amennyiben a fa bejárása során elérhetők. A bejáró algoritmus a végpontoknál megáll, és így a végpontok rokonai - amennyiben nem érhetők el más útvonalon - nem kerülnek bele az exportált ágba. Amennyiben egy személy belekerül az exportálandó ágba, minden kapcsolt rekord (család, média, forrás, megjegyzés, repozitórium) bekerül.

source: Note: Exporting the content of the branch requires that the Clippings cart module is installed and activated.
de: Bemerkung: Um die Daten dieses Astes zu exportieren ist das Sammelbehälter Modul erforderlich und muss aktiviert sein.
hu: Megjegyzés: az exportálás végrehajtásához a Metszési kosár (Clippings cart) modul telepítése és aktiválása szükséges.

source: What records can be used as pivot point?
de: Welche Datensätze können als Drehpunkte benutzt werden?
hu: Mely rekordok lehetnek kiindulópontok?

source: Only individuals can be used as pivot point. Any individual in the tree can be used.
de: Es können nur Personen als Drehpunkte benutzt werden. Es ist egal welche Person es ist.
hu: Csak személyek lehetnek kiindulópontok. A családfában megtalálható bármely személy lehet kiindulópont.

source: What records can be used as cutoff points?
de: Welche Datensätze können als Endpunkte benutzt werden?
hu: Milyen rekordok lehetnek végpontok?

source: Only individuals and families can be used as cutoff points. Any individual or family in the tree can be used. Using a family as cutoff point is a shortcut for adding all individuals in that family as cutoff points.
de: Jegliche Personen und Familien Datensätze können als Endpunkte benutzt werden. Wenn ein Familien Datensatz gewählt wird, dann werden alle Personen in dieser Familie als Endpunkte dazu genommen.
hu: Csak személyek és családok lehetnek végpontok. Bármely személy vagy család lehet végpont. Amennyiben egy családot vesz fel végpontként, akkor a család minden tagja végpontnak fog számítani.

source: Added Hungarian and German localization
hu: Magyar és német fordítás

source: Fixed: 'Unable to delete preset (None)' error message when pressing Delete without selecting a preset.
hu: Hibajavítás: 'Unable to delete preset (None)' hibaüzenet jelent meg, ha a 'Törlés' gombra kattintott, de nem választott sablont.

source: Fixed: when clicking Delete, the confirmation dialog used the value of the 'Name' input field instead the name of the selected Preset.
hu: Hibajavítás: ha a 'Törlés'-re kattintott, a megerősítést kérő párbeszédablak tévesen a 'Név' mező értékét jelenítette meg a törlendő sablon neveként, nem a legörülő menüből kiválasztott sablon tényleges nevét.

source: Fixed: when renaming a preset with the new name being identical to the current name, 'duplicate key' error message was displayed.
hu: Hibajavítás: egy sablon átnevezése során, amennyiben az új név megegyezett a jelenlegivel, 'duplicate entry' hibaüzenet jelent meg.

source: Fixed: after saving/deleting/renaming a preset the preset list was refreshed incorrectly, preventing further rename/delete operations (until page refresh).
hu: Hibajavítás: sablon mentése/törlése/átnevezése után a sablonlista helytelenül frissült, ezért az oldal újratöltéséig nem működött a törlés és átnevezés funkció.

source: First public release
hu: Az első nyilvános verzió

source: Improved help section, as well as other changes/fixes to certain text elements
hu: Javított Súgó, valamint kisebb javítások egyéb szöveges elemekhez

source: Warning message is now displayed if Clippings cart module is disabled
hu: Figyelmeztető üzenet jelenik meg, ha a Metszési kosár modul nincs aktiválva

source: Added install/uninstall features
hu: Telepítés/eltávolítás funkció

source: Added release log
hu: Kiadási megjegyzések

source: Added Save &amp; Rename command
hu: Mentés &amp; Átnevezés funkció

source: Clicking 'Delete' will now ask for confirmation before deleting the preset
de: Zusätzliche Dialog Box um Ast Vordefinitionen zu löschen
hu: A 'Törlés' mostantól megerősítést kér

source: Fixed: 'Name' field contained the id of the preset (instead of the name) after clicking 'Preview'; 'Load preset' also lost its stored value, and was reset to '(None)'.
hu: Hibajavítás: Az 'Előnézet' gombra történő kattintás után a 'Név' mezőben a sablon azonosítója jelent meg a neve helyett. A 'Sablon betöltése' elvesztett tárolt értékét, és visszaállt '(Nincs)'-re.

source: Branch export help
de: Branch Export Hilfe
hu: Branch export súgó

source: Release log
de: Freigabeprotokoll
hu: Kiadási megjegyzések

source: Branch settings
de: Ast Einstellungen
hu: Ág beállításai

source: Load preset:
de: Ast Einstellung laden:
hu: Sablon betöltése:

source: (None)
de: (Nichts)
hu: (Nincs)

source: Pivot point:
de: Drehpunkt:
hu: Kiindulópont:

source: Add cutoff point
de: Neuer Endpunkt
hu: Végpont hozzáadása

source: Preview branch
de: Ast Vorschau
hu: Előnézet

source: Export branch
de: Ast exportieren
hu: Exportálás

source: Save branch export preset
de: Ast Einstellung speichern
hu: Sablon mentése

source: Save
de: Speichern
hu: Mentés

source: Rename &amp; Save
de: Umbenennen &amp; Speichern
hu: Átnevezés &amp; mentés

source: Delete
de: Löschen
hu: Törlés

source: Clippings cart module is disabled. 'Export branch' will not work!
de: Sammelbehälter Modul ist deaktiviert. 'Export branch' wird nicht funktionieren!
hu: A Metszési kosár (Clippings cart) module nincs aktiválva. Az exportálás nem fog működni!

source: Allows exporting a branch of a tree. Requires Clippings cart module!
de: Erlaubt das exportieren eines Astes dieses Baumes. Benötigt das Sammelbehälter Modul!
hu: Lehetővé teszi a családfa egyedi módon meghatározott részletének az exportálását. Az exportáláshoz a Metszési kosár modulra is szükség van!

source: Config
de: Einstellungen
hu: Beállítások

source: Help
de: Hilfe
hu: Súgó

source: Branch export module needs a database update. Please visit the module's main page to perform this update!
de: Das Branch Export Modul benötigt ein Datenbank update. Bitte der Hauptseite dieses Modules die Funktion ausführen!
hu: A Branch export modul további használatához az adatbázis frissítése szükséges. Kérjük, keresse fel a modul főoldalát a frissítés végrehajtásához!

source: Export new branch from:
de: Exportiere neuen Ast von:
hu: Új ág exportálása innen kiindulva:

source: Export preset branch:
de: Exportiere Ast Einstellung:
hu: Sablon exportálása:

source: Export this branch
de: Exportiere diesen Ast
hu: Ág exportálása

source: No branch export presets defined for this individual.
de: Keine Ast Einstellung definiert für diese Person.
hu: Még nem hozott létre exportálási sablont ehhez a személyhez.
